RouNNdeL/esp8266-leds/src/main.cpp
String getDeviceJson()
{
    String profile_array = "[";
    for(uint8_t i = 0; i < globals.profile_count; ++i)
    {
        if(i) profile_array += ",";
        profile_array += String(globals.profile_order[i]);
    }
    profile_array += "]";

    String brightness_array = "[";
    String flags_array = "[";
    String color_array = "[";
    for(uint8_t i = 0; i < DEVICE_COUNT; ++i)
    {
        if(i) brightness_array += ",";
        if(i) flags_array += ",";
        if(i) color_array += ",";

        brightness_array += String(globals.brightness[i]);
        flags_array += String(globals.flags[i]);
        color_array += String((uint32_t) globals.color[0] << 16 | (uint16_t) globals.color[1] << 8 | globals.color[2]);
    }
    brightness_array += "]";
    flags_array += "]";
    color_array += "]";

    String content = R"({"ap_name":")" + String(AP_NAME) +
                     R"(","version_code":)" + String(VERSION_CODE) +
                     R"(,"version_name":")" + String(VERSION_NAME) +
                     R"(","device_id":)" + String(DEVICE_ID) +
                     ",\"auto_increment\":" + String(auto_increment / FPS) +
                     ",\"current_profile\":" + String(globals.n_profile) +
                     ",\"color\":" + color_array +
                     ",\"flags\":" + flags_array +
                     ",\"brightness\":" + brightness_array +
                     ",\"profiles\": " + profile_array + "}";
    return content;
}

#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wconversion"

uint8_t sendDeviceState(const String &requestId)
{
    HTTPClient http;
    http.begin(HTTP_UPDATE_HOST, HTTP_UPDATE_PORT, String(HTTP_STATE_URL),
               HTTP_UPDATE_HTTPS_FINGERPRINT);
    http.useHTTP10(true);
    http.setTimeout(500);
    http.setUserAgent(F("ESP8266"));
    http.addHeader(F("Content-Type"), "application/json");

    if(requestId.length() > 0 && requestId[0] != 0x00)
        http.addHeader(F("x-Request-Id"), requestId);


    int code = http.POST(getDeviceJson());
    http.end();
    return code;
}

#pragma clang diagnostic pop

#if PAGE_DEBUG

void ICACHE_FLASH_ATTR debug_info()
{
    String r = String(globals.color[0], 16);
    String g = String(globals.color[1], 16);
    String b = String(globals.color[2], 16);
    r = r.length() == 1 ? "0" + r : r;
    g = g.length() == 1 ? "0" + g : g;
    b = b.length() == 1 ? "0" + b : b;

    String flags_array = "[";
    String brightness_array = "[";
    for(uint8_t i = 0; i < DEVICE_COUNT; i++)
    {
        if(i) flags_array += ",";
        if(i) brightness_array += ",";

        flags_array += String(globals.flags[i]);
        brightness_array += String(globals.brightness[i]);
    }
    flags_array += "]";
    brightness_array += "]";


    String content = "<h2>" + String(AP_NAME) + "</h2>";
    content += "<p>config_url: <a href=\"" + String(CONFIG_PAGE) + "\">" + CONFIG_PAGE + "</a></p>";
    content += "<p>version_code: <b>" + String(VERSION_CODE) + "</b></p>";
    content += "<p>version_name: <b>" + String(VERSION_NAME) + "</b></p>";
    content += "<p>build_date: <b>" + BUILD_DATE + "</b></p>";
    content += "<p>reset_info: <b>" + ESP.getResetReason() + "</b></p>";
    content += "<p>device_id: <b>" + String(DEVICE_ID) + "</b></p>";
    content += "<p>flags: <b>" + flags_array + "</b></p>";
    content += "<p>color: <b>#" + r + g + b + "</b></p>";
    content += "<p>brightness: <b>" + brightness_array + "</b></p>";
    content += "<p>profile_count: <b>" + String(globals.profile_count) + "</b></p>";
    content += "<p>auto_increment: <b>" + String(globals.auto_increment) + "</b></p>";
    content += "<p>auto_increment frames: <b>" + String(auto_increment) + "</b></p>";
    content += "<p>current_profile: <b>" + String(globals.n_profile) + "</b></p>";
    content += "<p>profile_order: <b>[";
    for(uint8_t i = 0; i < PROFILE_COUNT; i++)
    {
        if(i) content += ",";
        content += String(globals.profile_order[i]);
    }
    content += "]</b></p>";
    server.send(200, "text/html", content);
}

#endif /* PAGE_DEBUG */

void ICACHE_FLASH_ATTR receive_globals()
{
    if(server.hasArg("plain") &&
       server.method() == HTTP_PUT &&
       (server.arg("plain").length() == GLOBALS_SIZE * 2 ||
        (server.arg("plain").length() < GLOBALS_SIZE &&
         server.arg("plain").end()[-1] == '*')))
    {
        uint8_t bytes[GLOBALS_SIZE];
        auto c = server.arg("plain");
        for(uint8_t i = 0; i < GLOBALS_SIZE; ++i)
        {
            if(c[i * 2] == '*' || c[i * 2 + 1] == '*')
            {
                memcpy(bytes + i, ((uint8_t *) &globals) + i, GLOBALS_SIZE - i);
                break;
            }
            if(c[i * 2] == '?' && c[i * 2 + 1] == '?')
            {
                bytes[i] = ((uint8_t *) &globals)[i];
            }
            else
            {
                bytes[i] = char2int(c[i * 2]) * 16 + char2int(c[i * 2 + 1]);
            }
        }
        uint8_t previous_profile = globals.profile_order[globals.n_profile];
        uint8_t previous_auto_increment = globals.auto_increment;
        memcpy(&globals, bytes, GLOBALS_SIZE);
        if(previous_profile != globals.profile_order[globals.n_profile])
        {
            frame = 0;
            refresh_profile();
        }
        if(previous_auto_increment != globals.auto_increment)
        {
            auto_increment = autoincrement_to_frames(globals.auto_increment);
        }
        save_globals(&globals);
        convert_color();

        sendDeviceState(server.header("x-Request-Id"));
        server.send(204);
    }
    else
    {
#if SERIAL_DEBUG
        server.send(400, "text/html", "<h2>HTTP 400 Invalid Request</h2>");
#else
        server.send(400);
#endif /* SERIAL_DEBUG */
    }
}

void ICACHE_FLASH_ATTR redirect_to_config()
{
    server.sendHeader("Location", CONFIG_PAGE);
    server.send(301);
}

void ICACHE_FLASH_ATTR receive_profile()
{
    if(server.hasArg("plain") && server.arg("plain").length() == (PROFILE_SIZE + 1) * 2 && server.method() == HTTP_PUT)
    {
        uint8_t bytes[PROFILE_SIZE + 1];
        auto c = server.arg("plain");
        for(uint8_t i = 0; i < sizeof(bytes); ++i)
        {
            bytes[i] = char2int(c[i * 2]) * 16 + char2int(c[i * 2 + 1]);
        }

        if(globals.n_profile == bytes[0])
        {
            memcpy(&current_profile, bytes + 1, PROFILE_SIZE);
            convert_all_frames();
            flags |= FLAG_PROFILE_UPDATED;
        }
        else
        {
            profile tmp; // NOLINT
            memcpy(&tmp, bytes + 1, PROFILE_SIZE);
            save_profile(&tmp, bytes[0]);
        }
        server.send(204);
    }
    else
    {
#if SERIAL_DEBUG
        server.send(400, "text/html", "<h2>HTTP 400 Invalid Request</h2>");
#else
        server.send(400);
#endif /* SERIAL_DEBUG */
    }
}

