RouNNdeL/esp8266-leds/src/main.cpp
void ICACHE_FLASH_ATTR change_profile()
{
    if(server.hasArg("plain") && server.arg("plain").length() == 1 && server.method() == HTTP_POST)
    {
        /* We subtract the 1 added previously when creating the webpage */
        uint8_t i = (uint8_t) server.arg("plain")[0] - 1;
        if(flags & FLAG_PROFILE_UPDATED)
        {
            save_profile(&current_profile, globals.profile_order[globals.n_profile]);
            flags &= ~FLAG_PROFILE_UPDATED;
        }
        globals.n_profile = i;
        refresh_profile();

        frame = 0;
        auto_increment = autoincrement_to_frames(globals.auto_increment);

        server.send(200, "application/json", R"({"status": "success"})");
    }
    else
    {
#if SERIAL_DEBUG
        server.send(400, "text/html", "<h2>HTTP 400 Invalid Request</h2>");
#else
        server.send(400);
#endif /* SERIAL_DEBUG */
    }
}

void ICACHE_FLASH_ATTR handle_root()
{
    String r = String(globals.color[0], 16);
    String g = String(globals.color[1], 16);
    String b = String(globals.color[2], 16);
    r = r.length() == 1 ? "0" + r : r;
    g = g.length() == 1 ? "0" + g : g;
    b = b.length() == 1 ? "0" + b : b;
    String content =
            R"(<!DOCTYPE html><html lang="en"><head><meta charset="UTF-8"><meta name="viewport" content="width=device-width, initial-scale=1.0"><title>)" +
            String(AP_NAME) + "</title></head><body><h2>" + AP_NAME +
            R"(</h2><p>You can change profiles and set a static color for your LEDs, for more advanced configuration click <a href="/config">here</a></p> <input id="a" type="color" value="#)" +
            r + g + b + R"("> <select id="b">)";
    for(uint8_t i = 0; i < globals.profile_count; ++i)
    {
        String selected = i == globals.n_profile ? "selected" : "";
        /* We add 1 to avoid sending a NULL which is a String termination character in C.
         * The profile_n endpoint will then subtract that 1 to account for that*/
        content += "<option value=\"" + String(i + 1) + "\" " + selected + ">" + String(globals.profile_order[i]) +
                   "</option>";
    }
    content += R"(</select><p><a href="/restart">Restart device</a></p><p><a href="/update">Check for updates</a></p> <script>document.getElementById("a").addEventListener("change",function(e){var t=new XMLHttpRequest;t.open("PUT","/globals",!0),t.send("??????????"+e.target.value.substring(1)+"*")}),document.getElementById("b").addEventListener("change",function(e){var t=new XMLHttpRequest;t.open("PUT","/globals",!0),t.send("????"+("0"+(16).toString(e.target.value)).slice(-2))+"*";)});</script> </body></html>)";
    server.send(200, "text/html", content);
}

void ICACHE_FLASH_ATTR restart()
{
    server.send(200, "text/html",
                "<p>Your device is restarting...</p><p><a href=\"/\">Go back to configuration panel</a></p>");
    delay(500);
    ESP.restart();
}

void ICACHE_FLASH_ATTR send_json()
{
    server.send(200, "application/json", getDeviceJson());
}

void ICACHE_FLASH_ATTR manual_update_check()
{
    auto code = checkUpdate();
    String statusString;
    switch(code)
    {
        case HTTP_CODE_NO_CONTENT:
            statusString = "Update found, click <a href=\"/apply_update\">here</a> to download and apply the update";
            break;
        case HTTP_CODE_NOT_MODIFIED:
            statusString = "No updates found, <a href=\"/\">return to the main page<a/>";
            break;
        default:
            statusString = "Update check failed: HTTP " + code;
            break;
    }
    server.send(200, "text/html", statusString);
}

void ICACHE_FLASH_ATTR apply_update()
{
    server.send(200, "text/html",
                "<p>The device will now download the update and restart to apply the changes</p><p><a href=\"/\">Main page</a></p>");
    delay(500);
    update(1);
}

void on_disconnected(const WiFiEventStationModeDisconnected &event)
{
    ESP.restart();
}

void configModeCallback(WiFiManager *myWiFiManager)
{
    setStripStatus(COLOR_CYAN);
}

void handleUdp()
{
    int packetSize = Udp.parsePacket();
    if(packetSize)
    {
        uint8_t buffer[32];
        int len = Udp.read(buffer, 32);
        if(len > 0)
        {
            buffer[len] = 0;
        }
        if(String((char *) buffer) == UDP_DISCOVERY_MSG)
        {
            Udp.beginPacket(Udp.remoteIP(), Udp.remotePort());
            String resp = R"({"message":")" + String(UDP_DISCOVERY_RESPONSE) + R"(", "name":")" + AP_NAME + "\"}";
            char bytes[resp.length()];
            resp.toCharArray(bytes, resp.length() + 1);
            Udp.write(bytes, resp.length());
            Udp.endPacket();
        }
    }
}

void recover()
{
    EEPROM.begin(SPI_FLASH_SEC_SIZE);

    for(uint8_t i = 0; i < DEVICE_COUNT; ++i)
    {
        globals.brightness[i] = 0xff;
        globals.flags[i] = GLOBALS_FLAG_ENABLED | GLOBALS_FLAG_STATUSES;

        current_profile.devices[i].effect = PIECES;
        current_profile.devices[i].color_count = 2;
        current_profile.devices[i].color_cycles = 1;
        current_profile.devices[i].timing[TIME_OFF] = 0;
        current_profile.devices[i].timing[TIME_FADEIN] = 0;
        current_profile.devices[i].timing[TIME_ON] = 60;
        current_profile.devices[i].timing[TIME_FADEOUT] = 30;
        current_profile.devices[i].timing[TIME_ROTATION] = 90;
        current_profile.devices[i].timing[TIME_DELAY] = 0;
        current_profile.devices[i].args[ARG_BIT_PACK] = DIRECTION | SMOOTH;
        current_profile.devices[i].args[ARG_PIECES_PIECE_COUNT] = 6;
        current_profile.devices[i].args[ARG_PIECES_COLOR_COUNT] = 2;
        set_color_manual(current_profile.devices[i].colors, grb(COLOR_RED));
        set_color_manual(current_profile.devices[i].colors + 3, grb(COLOR_BLUE));
    }

    globals.auto_increment = 0;
    globals.profile_order[0] = 0;
    globals.profile_count = 1;
    globals.n_profile = 0;

    convert_all_frames();

    save_globals(&globals);
    save_profile(&current_profile, 0);
}

void setup()
{
#if SERIAL_DEBUG
    Serial.begin(115200);

    Serial.println("");
    Serial.println("|---------------------------|");
    Serial.println("|------ Begin Startup ------|");
    Serial.println("| LED Controller by RouNdeL |");
    Serial.println("|---------------------------|");

    Serial.println("Version Name: " + String(VERSION_NAME));
    Serial.println("Version Code: " + String(VERSION_CODE));
    Serial.println("Build Date: " + BUILD_DATE);
    Serial.println("Device Id: " + String(DEVICE_ID));
#endif /* SERIAL_DEBUG */

#if RECOVER
    recover();
#else
    eeprom_init();
#endif /* RECOVER */

    strip.begin();
    setStripStatus(COLOR_RED);

    WiFiManager manager;
#if !SERIAL_DEBUG
    manager.setDebugOutput(0);
#endif /* SERIAL_DEBUG */
    manager.setAPCallback(configModeCallback);
    manager.setAPStaticIPConfig(IPAddress(192, 168, 1, 1), IPAddress(192, 168, 1, 1), IPAddress(255, 255, 255, 0));
    manager.setConfigPortalTimeout(300);
    manager.autoConnect(AP_NAME);

