RouNNdeL/esp8266-leds/src/main.cpp
    update(1);

#if SERIAL_DEBUG
    Serial.println("|---------------------------|");
    Serial.println("|------- Start LEDs --------|");
    Serial.println("|---------------------------|");
#endif /* SERIAL_DEBUG */

#if PAGE_DEBUG
    server.on("/debug", debug_info);
#endif /* PAGE_DEBUG */

    WiFi.onStationModeDisconnected(on_disconnected);

    server.on("/", handle_root);
    server.on("/restart", restart);
    server.on("/config", redirect_to_config);
    server.on("/globals", receive_globals);
    server.on("/profile", receive_profile);
    server.on("/api", send_json);
    server.on("/update", manual_update_check);
    server.on("/apply_update", apply_update);

    const char *headers[] = {"x-Request-Id"};
    size_t headers_size = sizeof(headers) / sizeof(char *);
    server.collectHeaders(headers, headers_size);

    Udp.begin(8888);
    server.begin();
    ArduinoOTA.begin();

    user_init();
}

void loop()
{
    server.handleClient();
    handleUdp();
    ArduinoOTA.handle();

    if(flags & FLAG_NEW_FRAME)
    {
        uint8 enabled = 0;

        uint16_t virtual_led_offset = 0;
        for(uint8_t d = 0; d < DEVICE_COUNT; ++d)
        {
            uint8_t *p = strip.getPixels() + virtual_led_offset * 3;
            if(globals.flags[d] & GLOBALS_FLAG_ENABLED)
            {
                enabled = 1;
                if(globals.flags[d] & GLOBALS_FLAG_EFFECTS)
                {

                    device_profile &device = current_profile.devices[d];
                    digital_effect((effect) device.effect, p, virtual_devices[d], 0, frame + frames[d][TIME_DELAY],
                                   frames[d], device.args, device.colors, device.color_count, device.color_cycles);


                    convert_bufs();

                    strip.show();
                    flags &= ~FLAG_NEW_FRAME;
                }
                else
                {
                    for(led_count_t i = 0; i < virtual_devices[d]; ++i)
                    {
                        set_color_manual(p + i * 3, grb(color_from_buf(color_converted)));
                    }
                    strip.show();
                }
            }
            else
            {
                for(led_count_t i = 0; i < LED_COUNT; ++i)
                {
                    set_color_manual(p + i * 3, grb(COLOR_BLACK));
                }
                strip.show();
            }

            virtual_led_offset += virtual_devices[d];
        }

        if(auto_increment && frame && frame % auto_increment == 0 && enabled && globals.profile_count > 1)
        {
            if(flags & FLAG_PROFILE_UPDATED)
            {
                save_profile(&current_profile, globals.profile_order[globals.n_profile]);
                flags &= ~FLAG_PROFILE_UPDATED;
            }
            increment_profile();
            refresh_profile();
            frame = 0;
        }
    }
}
